# PanelScheduleName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PanelScheduleName Property
ParameterTypeId Class See Also
---
"Panel Schedule Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PanelScheduleName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PanelScheduleName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PanelScheduleName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace